{
	"bugs":[
		{
			"date": "4-3-14",
			"file": "Articles.java",
			"desc": "I was orignially generating article ids by simply counting the nunmbers of articles present in the json file, and incrementing it by one. This lead to duplications of ids. Ids are used to edit, delete and track donations of articles, when they are not unique, it causes multiple deletions and errors when editing.",
			"status": "solved",
			"fix": "I fixed the bug by first creating a new entery in the database table 'articels' with the charity id of the creator, and the timestamp of when the article was created. We configured the db to automatically maintain a unique article id which was auto incremented on the entery of a new row in the table. After the values were entered into the db, I simply used a SELECT query to retrieve the latest atricle id using the charity id and timestamp, to avoid creating race conditions if other charities were creating articles at the same time.",
			"user": "Kevin Murphy",
			"priority": "Immediate",
			"severity": "High"
		},
		{
			"date": "6-3-14",
			"file": "Signup.java",
			"desc": "When using the OWASP HTML sanitizer to filter and sanitize user submitted input to defend against cross side scripting attacks, we found that the '@' symbol was being escaped into its ascii value '&#64;'.",
			"status": "solved",
			"fix": "But not using the OWASP sanitizer for filter the e-mail but by using the new HTML5 input type 'email' to ensure correct formatting on the client side, and doing manual checking of the email string paramater on the server side.",
			"user": "Kealan Smyth",
			"priority": "Medium",
			"severity": "Medium"
		},
		{
			"date": "11-3-14",
			"file": "homepage.js",
			"desc": "News articles on the client side are originally displayed in a condensed preview, then expanded on a user click to reveal the main content, then giving the user the option of minimizing the content. The UI element used to perform this toggling of the content area sometime would act in an unexpected manner, for instance, when the content was expanded, it would still read 'Click here to read more.. ', instead of the correct text 'Hide/Less..'. Ths functionality was not in error, but the UI element was.   ",
			"status": "unsolved",
			"fix": "The fix requires that each article maintains a boolean whether it's expanded or not, we were unable to ",
			"user": "Kevin Murphy",
			"priority": "Low",
			"severity": "Low"
		},
		{
			"date": "12-3-14",
			"file": "Dashboard.java, dashboard.js",
			"desc": "Ajax calls within the Dashboard calling servlets needed to be paramatereised in order to customise the output from servlets. For example, the CreatePost.java servlet outputs a form which is used both at the server side Dashboard for charity admins to create post, and at the client side for user submitting posts. When the admin is creating a post, an option for posting to their social media account through OAuth is availible, but should not be to users visiting the site and creating post which must be approved before they get displayed on the site.",
			"status": "solved",
			"fix": "Paramatereising ajax requests and if statements with in the servlet to handle the different cases",
			"user": "Kevin Murphy",
			"priority": "Medium",
			"severity": "Medium"
		},
		{
			"date": "13-3-14",
			"file": "Dashboard.java, dashboard.js, homepage.js, Register.java, Upload.java",
			"desc": "Submitting multipart forms via Ajax requests not passing paramaters to the server correctly, null pointer exceptions being thrown.",
			"status": "solved",
			"fix": "Utilizing the Javascript FormData object to pass all the paramaters and image back to the Upload.java servlet and processing them using the apache commons IO and fileupload libraries.",
			"user": "Kevin Murphy",
			"priority": "Immediate",
			"severity": "High"
		},
		{
			"date": "15-3-14",
			"file": "Articles.java, EditPost.java",
			"desc": "Article tags were not being correctly converted and parsed from a String Object to a JSONArray of strings, and vice versa. This was leading to the incorrect formatting of the articles.json file.",
			"status": "solved",
			"fix": "Developed two methods to deal with both cases; converting from a String of characters seperated by a space character into a JSONArray,  and from a JSONArray into String of characters as to allow the charity administrator to edit them.",
			"user": "Kevin Murphy",
			"priority": "Medium",
			"severity": "Miedium"
		},
		{
			"date": "15-3-14",
			"file": "homepage.js",
			"desc": "Javascript JQuery Ajax request being cached. When content was updated and re-requested, it was not updated, as the previous request was cached.",
			"status": "solved",
			"fix": "Fixed with one statement, $.ajaxSetup({cahce:false});, this configues ajax so that there is no caching.",
			"user": "Kevin Murphy",
			"priority": "Medium",
			"severity": "Miedium"
		},
		{
			"date": "16-3-14",
			"file": "Articles.js, EditPost.java, Upload.java",
			"desc": "When editing an Article/Post changing the image associated with that post would not update correctly, leaving the original image with the post, though the new image was upload succesfully",
			"status": "solved",
			"fix": "Altered the Uplaod.java class to ensure it input the new image's name into the articles.json file ",
			"user": "Kevin Murphy",
			"priority": "Medium",
			"severity": "Miedium"
		},
		{
			"date": "17-3-14",
			"file": "homepage.js, dashboard.js, general.js",
			"desc": "The fucntion to read in the FAQ Q&As which were stored in a JSON file was formatting the html to display the FAQs incorrectly, causing an ununified UI.",
			"status": "solved",
			"fix": "Alerted the functions in each file to correctly generate a heirarcical structure of nested Q&As lists giving the desired output",
			"user": "Teng Yu",
			"priority": "low",
			"severity": "low"
		}

	]
}